Config/Documents/SMSDelivery.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>SMSDelivery</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsByCustomers</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DeliveryTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SMSTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateTextRu</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateTextEn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateTextDe</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sender</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SMSDeliveryStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AttachmentPath</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DistributionListName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DistributionListId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpecialOffer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SpecialOffers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpecialOfferStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OfferStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpecialOfferAttachToReservations</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Receivers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Phone</Name>
							<Comment>79876543210</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EMail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SMSText</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IsSent</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Result</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MessageID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Clients</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ClientDoc</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Accommodation</v8:Type>
								<v8:Type>cfg:DocumentRef.Reservation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Customer</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Customers</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NumberOfSMS</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MessageLength</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Cost</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/PrintDirections.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>PrintDirections</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Screen</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Printer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MXL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLSX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PDF</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/SMSDelivery/Ext/ManagerModule.bsl
#Region Public

// --------------------------------------------------------------------------------
Procedure pmPrintSMSReceivers(pDocs, pSpreadsheet, pObjectPrintForm, pLanguage, rDoPrint = Undefined) Export
	pSpreadsheet.Clear();
	If pDocs.Count() = 0 Then
		Return;
	EndIf;
	
	// Choose template
	vTemplate = Documents.SMSDelivery.GetTemplate("PrintSMSReceivers");
	// Load external template if any
	vExtTemplate = cmReadExternalSpreadsheetDocumentTemplate(pObjectPrintForm);
	If vExtTemplate <> Undefined Then
		vTemplate = vExtTemplate;
	EndIf;
	
	For Each vDocsItem In pDocs Do
		// Add page split
		If pDocs.Indexof(vDocsItem) > 0 Then
			pSpreadsheet.PutHorizontalPageBreak();
		EndIf;
		
		SelSMSDelivery = vDocsItem.Value;
			
		// Header
		vHeader = vTemplate.GetArea("Header");	
		// Hotel
		vHotelObj = Catalogs.Hotels.EmptyRef();
		If ValueIsFilled(SessionParameters.CurrentHotel) Then
			vHotelObj = SessionParameters.CurrentHotel.GetObject();
		EndIf;
		mHotelPrintName = vHotelObj.pmGetHotelPrintName(pLanguage);
		If pLanguage = Catalogs.Languages.RU Then
			mTemplateText = TrimAll(SelSMSDelivery.TemplateTextRu);
		ElsIf pLanguage = Catalogs.Languages.EN Then
			mTemplateText = TrimAll(SelSMSDelivery.TemplateTextEn);
		ElsIf pLanguage = Catalogs.Languages.DE Then
			mTemplateText = TrimAll(SelSMSDelivery.TemplateTextDe);
		Else
			mTemplateText = TrimAll(SelSMSDelivery.TemplateTextRu);
		EndIf;
		// Document date
		mDate = Format(SelSMSDelivery.Date, "DF='dd.MM.yyyy'");
		// Document number
		mFormNumber = cmGetDocumentNumberPresentation(SelSMSDelivery.Number);
		// Fill header parameters
		vHeader.Parameters.mHotelPrintName = mHotelPrintName;
		vHeader.Parameters.mFormNumber = mFormNumber;
		vHeader.Parameters.mTemplateText = mTemplateText;
		vHeader.Parameters.mDate = mDate;
		If SelSMSDelivery.IsByCustomers Then
			vHeader.Parameters.mClientHeader = NStr("ru='Контрагент';en='Customer';de='Firma'");
		Else
			vHeader.Parameters.mClientHeader = NStr("en='Client';ru='Клиент';de='Kunde'");
		EndIf;
		pSpreadsheet.Put(vHeader);
		
		// Get row template area
		vSMSRow = vTemplate.GetArea("SMSRow");
		// Print receivers
		For Each vRow In SelSMSDelivery.Receivers Do
			// Fill parameters
			vSMSRow.Parameters.mLineNumber = vRow.LineNumber;
			vSMSRow.Parameters.mPhone = vRow.Phone;
			If SelSMSDelivery.IsByCustomers Then
				vSMSRow.Parameters.mClient = TrimAll(vRow.Customer);
			Else
				vSMSRow.Parameters.mClient = TrimAll(vRow.Client);
			EndIf;
			vSMSRow.Parameters.mIsSent = vRow.IsSent;
			vSMSRow.Parameters.mCost = Format(vRow.Cost, "ND=17; NFD=2; NZ=");
			vSMSRow.Parameters.mResult = SMS.ServerResponseDescription(TrimR(vRow.Result)).Text;
			// Put row
			pSpreadsheet.Put(vSMSRow);
		EndDo;
		
		// Put footer areas
		vFooter = vTemplate.GetArea("Footer");
		vFooter.Parameters.mTotalCost = cmFormatSum(SelSMSDelivery.Receivers.Total("Cost"), Catalogs.Currencies.FindByCode(643));
		mPosition = "";
		mAuthor = "";
		If ValueIsFilled(SelSMSDelivery.Author) Then
			mPosition = ?(Not IsBlankString(SelSMSDelivery.Author.Position), TrimAll(SelSMSDelivery.Author.Position), NStr("en='Manager';ru='Менеджер';de='Manager'"));
			mAuthor = SelSMSDelivery.Author.GetObject().pmGetEmployeeDescription(SessionParameters.CurrentLanguage);
		EndIf;
		vFooter.Parameters.mPosition = mPosition;
		vFooter.Parameters.mAuthor = mAuthor;
		pSpreadsheet.Put(vFooter);
	EndDo; // By documents in list

	// Setup default attributes
	cmSetDefaultPrintFormSettings(pSpreadsheet, PageOrientation.Portrait, True, 1, True);
	// Check authorities
	cmSetSpreadsheetProtection(pSpreadsheet);
	
	// Get and fill workstation print form settings
	If ValueIsFilled(SessionParameters.CurrentWorkstation) Then
		vWorkstationPrintSettings = SessionParameters.CurrentWorkstation.WorkstationPrintSettings;
		If ValueIsFilled(vWorkstationPrintSettings) Then
			// Try to find records for the current object print form
			vFilter = New Structure("ObjectPrintingForm, IsActive", pObjectPrintForm, True); 
			vPrintSettingsSet = vWorkstationPrintSettings.PrintFormsList.FindRows(vFilter);
			If vPrintSettingsSet.Count() > 0 Then
				For Each vPrintSettings In vPrintSettingsSet Do
					// Fill settings
					cmSetSpreadsheetSettings(pSpreadsheet, vPrintSettings);
					// Check printing direction
					If vPrintSettings.PrintDirection <> Enums.PrintDirections.Screen Then
						vName = cmGetPrintFormFileName(vPrintSettings, NStr("en='SMS receivers';ru='Список получателей СМС';de='SMS-Empfängerliste'")) + " " + TrimAll(SelSMSDelivery.Number);
						cmDoSpreadsheetOutput(pSpreadsheet, vPrintSettings, vName, rDoPrint);
					EndIf;
				EndDo;
			EndIf;
		EndIf;
	EndIf;
EndProcedure // pmPrintSMSReceivers

// --------------------------------------------------------------------------------
Procedure pmPrintEMailReceivers(pDocs, pSpreadsheet, pObjectPrintForm, pLanguage, rDoPrint = Undefined) Export
	pSpreadsheet.Clear();
	If pDocs.Count() = 0 Then
		Return;
	EndIf;
	
	// Choose template
	vTemplate = Documents.SMSDelivery.GetTemplate("PrintEMailReceivers");
	// Load external template if any
	vExtTemplate = cmReadExternalSpreadsheetDocumentTemplate(pObjectPrintForm);
	If vExtTemplate <> Undefined Then
		vTemplate = vExtTemplate;
	EndIf;
	
	For Each vDocsItem In pDocs Do
		// Add page split
		If pDocs.Indexof(vDocsItem) > 0 Then
			pSpreadsheet.PutHorizontalPageBreak();
		EndIf;
		
		SelSMSDelivery = vDocsItem.Value;
		
		// Header
		vHeader = vTemplate.GetArea("Header");	
		// Hotel
		vHotelObj = Catalogs.Hotels.EmptyRef();
		If ValueIsFilled(SessionParameters.CurrentHotel) Then
			vHotelObj = SessionParameters.CurrentHotel.GetObject();
		EndIf;
		mHotelPrintName = vHotelObj.pmGetHotelPrintName(pLanguage);
		If pLanguage = Catalogs.Languages.RU Then
			mTemplateText = TrimAll(SelSMSDelivery.TemplateTextRu);
		ElsIf pLanguage = Catalogs.Languages.EN Then
			mTemplateText = TrimAll(SelSMSDelivery.TemplateTextEn);
		ElsIf pLanguage = Catalogs.Languages.DE Then
			mTemplateText = TrimAll(SelSMSDelivery.TemplateTextDe);
		Else
			mTemplateText = TrimAll(SelSMSDelivery.TemplateTextRu);
		EndIf;
		// Document date
		mDate = Format(SelSMSDelivery.Date, "DF='dd.MM.yyyy'");
		// Document number
		mFormNumber = cmGetDocumentNumberPresentation(SelSMSDelivery.Number);
		// Fill header parameters
		vHeader.Parameters.mHotelPrintName = mHotelPrintName;
		vHeader.Parameters.mFormNumber = mFormNumber;
		vHeader.Parameters.mTemplateText = mTemplateText;
		vHeader.Parameters.mDate = mDate;
		If SelSMSDelivery.IsByCustomers Then
			vHeader.Parameters.mClientHeader = NStr("ru='Контрагент';en='Customer';de='Firma'");
		Else
			vHeader.Parameters.mClientHeader = NStr("en='Client';ru='Клиент';de='Kunde'");
		EndIf;
		pSpreadsheet.Put(vHeader);
		
		// Get row template area
		vSMSRow = vTemplate.GetArea("SMSRow");
		// Print receivers
		For Each vRow In SelSMSDelivery.Receivers Do
			// Fill parameters
			vSMSRow.Parameters.mLineNumber = vRow.LineNumber;
			vSMSRow.Parameters.mEMail = vRow.EMail;
			If SelSMSDelivery.IsByCustomers Then
				vSMSRow.Parameters.mClient = TrimAll(vRow.Customer);
			Else
				vSMSRow.Parameters.mClient = TrimAll(vRow.Client);
			EndIf;
			vSMSRow.Parameters.mIsSent = vRow.IsSent;
			vSMSRow.Parameters.mResult = SMS.ServerResponseDescription(TrimR(vRow.Result)).Text;
			// Put row
			pSpreadsheet.Put(vSMSRow);
		EndDo;
		
		// Put footer areas
		vFooter = vTemplate.GetArea("Footer");
		mPosition = "";
		mAuthor = "";
		If ValueIsFilled(SelSMSDelivery.Author) Then
			mPosition = ?(Not IsBlankString(SelSMSDelivery.Author.Position), TrimAll(SelSMSDelivery.Author.Position), NStr("en='Manager';ru='Менеджер';de='Manager'"));
			mAuthor = SelSMSDelivery.Author.GetObject().pmGetEmployeeDescription(SessionParameters.CurrentLanguage);
		EndIf;
		vFooter.Parameters.mPosition = mPosition;
		vFooter.Parameters.mAuthor = mAuthor;
		pSpreadsheet.Put(vFooter);
	EndDo; // By documents in list
	// Setup default attributes
	cmSetDefaultPrintFormSettings(pSpreadsheet, PageOrientation.Portrait, True, 1, True);
	// Check authorities
	cmSetSpreadsheetProtection(pSpreadsheet);
	// Get and fill workstation print form settings
	If ValueIsFilled(SessionParameters.CurrentWorkstation) Then
		vWorkstationPrintSettings = SessionParameters.CurrentWorkstation.WorkstationPrintSettings;
		If ValueIsFilled(vWorkstationPrintSettings) Then
			// Try to find records for the current object print form
			vFilter = New Structure("ObjectPrintingForm, IsActive", pObjectPrintForm, True); 
			vPrintSettingsSet = vWorkstationPrintSettings.PrintFormsList.FindRows(vFilter);
			If vPrintSettingsSet.Count() > 0 Then
				For Each vPrintSettings In vPrintSettingsSet Do
					// Fill settings
					cmSetSpreadsheetSettings(pSpreadsheet, vPrintSettings);
					// Check printing direction
					If vPrintSettings.PrintDirection <> Enums.PrintDirections.Screen Then
						vName = cmGetPrintFormFileName(vPrintSettings, NStr("en='E-Mail receivers';ru='Список получателей E-Mail';de='E-Mailempfängerliste'")) + " " + TrimAll(SelSMSDelivery.Number);
						cmDoSpreadsheetOutput(pSpreadsheet, vPrintSettings, vName, , rDoPrint);
					EndIf;
				EndDo;
			EndIf;
		EndIf;
	EndIf;
EndProcedure

// --------------------------------------------------------------------------------
//
// Parameters:
//  pData			 - CatalogRef	 - Ref
//  pReceiverNode	 - ExchangePlanRef	 - The Receiver node
//
Procedure ExchangePlansRecordChanges(pData, pReceiverNode = Undefined) Export
	ExchangePlansProcessing.ExchangePlansRecordChanges(pData, pData.Hotel, pReceiverNode);
EndProcedure // ExchangePlansRecordChanges

#EndRegion
